tinko26/ao/src/ao_sys_xc32_pic32/ao_can_4.h
// ----------------------------------------------------------------------------

// MIT License

// Copyright (c) 2022 Stefan Wagner

// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
// FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
// DEALINGS IN THE SOFTWARE.

// ----------------------------------------------------------------------------

// CAN 4.

// ----------------------------------------------------------------------------

#include <ao_can.h>
#include <ao_recv_obj.h>
#include <ao_send_obj.h>
#include <ao_sys.h>
#include <ao_task.h>
#include <stdbool.h>
#include <stdint.h>
#include <xc.h>

// ----------------------------------------------------------------------------

// Configuration.

// ----------------------------------------------------------------------------

#ifndef AO_CAN_4

#define AO_CAN_4                        (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_4

#define AO_CAN_BAUD_4                   (100000)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_SAMPLE_4

#define AO_CAN_BAUD_SAMPLE_4            (85)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_SAMPLE_THRICE_4

#define AO_CAN_BAUD_SAMPLE_THRICE_4     (true)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_SJW_4

#define AO_CAN_BAUD_SJW_4               (1)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_WAKE_UP_FILTER_4

#define AO_CAN_BAUD_WAKE_UP_FILTER_4    (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUFFERS_4_0

#define AO_CAN_BUFFERS_4_0              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_1

#define AO_CAN_BUFFERS_4_1              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_2

#define AO_CAN_BUFFERS_4_2              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_3

#define AO_CAN_BUFFERS_4_3              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_4

#define AO_CAN_BUFFERS_4_4              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_5

#define AO_CAN_BUFFERS_4_5              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_6

#define AO_CAN_BUFFERS_4_6              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_7

#define AO_CAN_BUFFERS_4_7              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_8

#define AO_CAN_BUFFERS_4_8              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_9

#define AO_CAN_BUFFERS_4_9              (0)

#endif

#ifndef AO_CAN_BUFFERS_4_10

#define AO_CAN_BUFFERS_4_10             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_11

#define AO_CAN_BUFFERS_4_11             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_12

#define AO_CAN_BUFFERS_4_12             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_13

#define AO_CAN_BUFFERS_4_13             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_14

#define AO_CAN_BUFFERS_4_14             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_15

#define AO_CAN_BUFFERS_4_15             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_16

#define AO_CAN_BUFFERS_4_16             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_17

#define AO_CAN_BUFFERS_4_17             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_18

#define AO_CAN_BUFFERS_4_18             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_19

#define AO_CAN_BUFFERS_4_19             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_20

#define AO_CAN_BUFFERS_4_20             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_21

#define AO_CAN_BUFFERS_4_21             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_22

#define AO_CAN_BUFFERS_4_22             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_23

#define AO_CAN_BUFFERS_4_23             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_24

#define AO_CAN_BUFFERS_4_24             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_25

#define AO_CAN_BUFFERS_4_25             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_26

#define AO_CAN_BUFFERS_4_26             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_27

#define AO_CAN_BUFFERS_4_27             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_28

#define AO_CAN_BUFFERS_4_28             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_29

#define AO_CAN_BUFFERS_4_29             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_30

#define AO_CAN_BUFFERS_4_30             (0)

#endif

#ifndef AO_CAN_BUFFERS_4_31

#define AO_CAN_BUFFERS_4_31             (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUS_4

#define AO_CAN_BUS_4                    (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FIFOS_RX_4

#define AO_CAN_FIFOS_RX_4               (0)

#endif

#ifndef AO_CAN_FIFOS_TX_4

#define AO_CAN_FIFOS_TX_4               (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_0

#define AO_CAN_FILTER_EID_4_0           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_0

#define AO_CAN_FILTER_ENABLE_4_0        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_0

#define AO_CAN_FILTER_FIFO_4_0          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_0

