tinko26/ao/src/ao_sys_xc32_pic32/ao_can_4.h
#define AO_CAN_FILTER_IDE_4_0           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_0

#define AO_CAN_FILTER_MASK_4_0          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_0

#define AO_CAN_FILTER_SID_4_0           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_1

#define AO_CAN_FILTER_EID_4_1           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_1

#define AO_CAN_FILTER_ENABLE_4_1        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_1

#define AO_CAN_FILTER_FIFO_4_1          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_1

#define AO_CAN_FILTER_IDE_4_1           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_1

#define AO_CAN_FILTER_MASK_4_1          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_1

#define AO_CAN_FILTER_SID_4_1           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_2

#define AO_CAN_FILTER_EID_4_2           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_2

#define AO_CAN_FILTER_ENABLE_4_2        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_2

#define AO_CAN_FILTER_FIFO_4_2          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_2

#define AO_CAN_FILTER_IDE_4_2           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_2

#define AO_CAN_FILTER_MASK_4_2          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_2

#define AO_CAN_FILTER_SID_4_2           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_3

#define AO_CAN_FILTER_EID_4_3           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_3

#define AO_CAN_FILTER_ENABLE_4_3        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_3

#define AO_CAN_FILTER_FIFO_4_3          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_3

#define AO_CAN_FILTER_IDE_4_3           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_3

#define AO_CAN_FILTER_MASK_4_3          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_3

#define AO_CAN_FILTER_SID_4_3           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_4

#define AO_CAN_FILTER_EID_4_4           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_4

#define AO_CAN_FILTER_ENABLE_4_4        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_4

#define AO_CAN_FILTER_FIFO_4_4          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_4

#define AO_CAN_FILTER_IDE_4_4           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_4

#define AO_CAN_FILTER_MASK_4_4          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_4

#define AO_CAN_FILTER_SID_4_4           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_5

#define AO_CAN_FILTER_EID_4_5           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_5

#define AO_CAN_FILTER_ENABLE_4_5        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_5

#define AO_CAN_FILTER_FIFO_4_5          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_5

#define AO_CAN_FILTER_IDE_4_5           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_5

#define AO_CAN_FILTER_MASK_4_5          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_5

#define AO_CAN_FILTER_SID_4_5           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_6

#define AO_CAN_FILTER_EID_4_6           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_6

#define AO_CAN_FILTER_ENABLE_4_6        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_6

#define AO_CAN_FILTER_FIFO_4_6          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_6

#define AO_CAN_FILTER_IDE_4_6           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_6

#define AO_CAN_FILTER_MASK_4_6          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_6

#define AO_CAN_FILTER_SID_4_6           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_7

#define AO_CAN_FILTER_EID_4_7           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_7

#define AO_CAN_FILTER_ENABLE_4_7        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_7

#define AO_CAN_FILTER_FIFO_4_7          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_7

#define AO_CAN_FILTER_IDE_4_7           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_7

#define AO_CAN_FILTER_MASK_4_7          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_7

#define AO_CAN_FILTER_SID_4_7           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_8

#define AO_CAN_FILTER_EID_4_8           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_8

#define AO_CAN_FILTER_ENABLE_4_8        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_8

#define AO_CAN_FILTER_FIFO_4_8          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_8

#define AO_CAN_FILTER_IDE_4_8           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_8

#define AO_CAN_FILTER_MASK_4_8          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_8

#define AO_CAN_FILTER_SID_4_8           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_9

#define AO_CAN_FILTER_EID_4_9           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_9

#define AO_CAN_FILTER_ENABLE_4_9        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_9

#define AO_CAN_FILTER_FIFO_4_9          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_9

#define AO_CAN_FILTER_IDE_4_9           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_9

#define AO_CAN_FILTER_MASK_4_9          (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_9

#define AO_CAN_FILTER_SID_4_9           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_10

#define AO_CAN_FILTER_EID_4_10          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_10

#define AO_CAN_FILTER_ENABLE_4_10       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_10

#define AO_CAN_FILTER_FIFO_4_10         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_10

#define AO_CAN_FILTER_IDE_4_10          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_10

#define AO_CAN_FILTER_MASK_4_10         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_10

#define AO_CAN_FILTER_SID_4_10          (0)

#endif

// ----------------------------------------------------------------------------

