tinko26/ao/src/ao_sys_xc32_pic32/ao_can_4.h
#ifndef AO_CAN_FILTER_EID_4_11

#define AO_CAN_FILTER_EID_4_11          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_11

#define AO_CAN_FILTER_ENABLE_4_11       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_11

#define AO_CAN_FILTER_FIFO_4_11         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_11

#define AO_CAN_FILTER_IDE_4_11          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_11

#define AO_CAN_FILTER_MASK_4_11         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_11

#define AO_CAN_FILTER_SID_4_11          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_12

#define AO_CAN_FILTER_EID_4_12          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_12

#define AO_CAN_FILTER_ENABLE_4_12       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_12

#define AO_CAN_FILTER_FIFO_4_12         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_12

#define AO_CAN_FILTER_IDE_4_12          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_12

#define AO_CAN_FILTER_MASK_4_12         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_12

#define AO_CAN_FILTER_SID_4_12          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_13

#define AO_CAN_FILTER_EID_4_13          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_13

#define AO_CAN_FILTER_ENABLE_4_13       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_13

#define AO_CAN_FILTER_FIFO_4_13         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_13

#define AO_CAN_FILTER_IDE_4_13          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_13

#define AO_CAN_FILTER_MASK_4_13         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_13

#define AO_CAN_FILTER_SID_4_13          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_14

#define AO_CAN_FILTER_EID_4_14          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_14

#define AO_CAN_FILTER_ENABLE_4_14       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_14

#define AO_CAN_FILTER_FIFO_4_14         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_14

#define AO_CAN_FILTER_IDE_4_14          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_14

#define AO_CAN_FILTER_MASK_4_14         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_14

#define AO_CAN_FILTER_SID_4_14          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_15

#define AO_CAN_FILTER_EID_4_15          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_15

#define AO_CAN_FILTER_ENABLE_4_15       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_15

#define AO_CAN_FILTER_FIFO_4_15         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_15

#define AO_CAN_FILTER_IDE_4_15          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_15

#define AO_CAN_FILTER_MASK_4_15         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_15

#define AO_CAN_FILTER_SID_4_15          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_16

#define AO_CAN_FILTER_EID_4_16          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_16

#define AO_CAN_FILTER_ENABLE_4_16       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_16

#define AO_CAN_FILTER_FIFO_4_16         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_16

#define AO_CAN_FILTER_IDE_4_16          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_16

#define AO_CAN_FILTER_MASK_4_16         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_16

#define AO_CAN_FILTER_SID_4_16          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_17

#define AO_CAN_FILTER_EID_4_17          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_17

#define AO_CAN_FILTER_ENABLE_4_17       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_17

#define AO_CAN_FILTER_FIFO_4_17         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_17

#define AO_CAN_FILTER_IDE_4_17          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_17

#define AO_CAN_FILTER_MASK_4_17         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_17

#define AO_CAN_FILTER_SID_4_17          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_18

#define AO_CAN_FILTER_EID_4_18          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_18

#define AO_CAN_FILTER_ENABLE_4_18       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_18

#define AO_CAN_FILTER_FIFO_4_18         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_18

#define AO_CAN_FILTER_IDE_4_18          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_18

#define AO_CAN_FILTER_MASK_4_18         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_18

#define AO_CAN_FILTER_SID_4_18          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_19

#define AO_CAN_FILTER_EID_4_19          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_19

#define AO_CAN_FILTER_ENABLE_4_19       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_19

#define AO_CAN_FILTER_FIFO_4_19         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_19

#define AO_CAN_FILTER_IDE_4_19          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_19

#define AO_CAN_FILTER_MASK_4_19         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_19

#define AO_CAN_FILTER_SID_4_19          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_20

#define AO_CAN_FILTER_EID_4_20          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_20

#define AO_CAN_FILTER_ENABLE_4_20       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_20

#define AO_CAN_FILTER_FIFO_4_20         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_20

#define AO_CAN_FILTER_IDE_4_20          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_20

#define AO_CAN_FILTER_MASK_4_20         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_20

#define AO_CAN_FILTER_SID_4_20          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_21

#define AO_CAN_FILTER_EID_4_21          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_21

#define AO_CAN_FILTER_ENABLE_4_21       (false)

#endif

