tinko26/ao/src/ao_sys_xc32_pic32/ao_can_4.h
#ifndef AO_CAN_FILTER_FIFO_4_21

#define AO_CAN_FILTER_FIFO_4_21         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_21

#define AO_CAN_FILTER_IDE_4_21          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_21

#define AO_CAN_FILTER_MASK_4_21         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_21

#define AO_CAN_FILTER_SID_4_21          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_22

#define AO_CAN_FILTER_EID_4_22          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_22

#define AO_CAN_FILTER_ENABLE_4_22       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_22

#define AO_CAN_FILTER_FIFO_4_22         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_22

#define AO_CAN_FILTER_IDE_4_22          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_22

#define AO_CAN_FILTER_MASK_4_22         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_22

#define AO_CAN_FILTER_SID_4_22          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_23

#define AO_CAN_FILTER_EID_4_23          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_23

#define AO_CAN_FILTER_ENABLE_4_23       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_23

#define AO_CAN_FILTER_FIFO_4_23         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_23

#define AO_CAN_FILTER_IDE_4_23          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_23

#define AO_CAN_FILTER_MASK_4_23         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_23

#define AO_CAN_FILTER_SID_4_23          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_24

#define AO_CAN_FILTER_EID_4_24          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_24

#define AO_CAN_FILTER_ENABLE_4_24       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_24

#define AO_CAN_FILTER_FIFO_4_24         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_24

#define AO_CAN_FILTER_IDE_4_24          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_24

#define AO_CAN_FILTER_MASK_4_24         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_24

#define AO_CAN_FILTER_SID_4_24          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_25

#define AO_CAN_FILTER_EID_4_25          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_25

#define AO_CAN_FILTER_ENABLE_4_25       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_25

#define AO_CAN_FILTER_FIFO_4_25         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_25

#define AO_CAN_FILTER_IDE_4_25          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_25

#define AO_CAN_FILTER_MASK_4_25         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_25

#define AO_CAN_FILTER_SID_4_25          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_26

#define AO_CAN_FILTER_EID_4_26          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_26

#define AO_CAN_FILTER_ENABLE_4_26       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_26

#define AO_CAN_FILTER_FIFO_4_26         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_26

#define AO_CAN_FILTER_IDE_4_26          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_26

#define AO_CAN_FILTER_MASK_4_26         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_26

#define AO_CAN_FILTER_SID_4_26          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_27

#define AO_CAN_FILTER_EID_4_27          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_27

#define AO_CAN_FILTER_ENABLE_4_27       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_27

#define AO_CAN_FILTER_FIFO_4_27         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_27

#define AO_CAN_FILTER_IDE_4_27          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_27

#define AO_CAN_FILTER_MASK_4_27         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_27

#define AO_CAN_FILTER_SID_4_27          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_28

#define AO_CAN_FILTER_EID_4_28          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_28

#define AO_CAN_FILTER_ENABLE_4_28       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_28

#define AO_CAN_FILTER_FIFO_4_28         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_28

#define AO_CAN_FILTER_IDE_4_28          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_28

#define AO_CAN_FILTER_MASK_4_28         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_28

#define AO_CAN_FILTER_SID_4_28          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_29

#define AO_CAN_FILTER_EID_4_29          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_29

#define AO_CAN_FILTER_ENABLE_4_29       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_29

#define AO_CAN_FILTER_FIFO_4_29         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_29

#define AO_CAN_FILTER_IDE_4_29          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_29

#define AO_CAN_FILTER_MASK_4_29         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_29

#define AO_CAN_FILTER_SID_4_29          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_30

#define AO_CAN_FILTER_EID_4_30          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_30

#define AO_CAN_FILTER_ENABLE_4_30       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_30

#define AO_CAN_FILTER_FIFO_4_30         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_4_30

#define AO_CAN_FILTER_IDE_4_30          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_30

#define AO_CAN_FILTER_MASK_4_30         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_30

#define AO_CAN_FILTER_SID_4_30          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_4_31

#define AO_CAN_FILTER_EID_4_31          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_4_31

#define AO_CAN_FILTER_ENABLE_4_31       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_4_31

#define AO_CAN_FILTER_FIFO_4_31         (0)

#endif

