tinko26/ao/src/ao_sys_xc32_pic32/ao_can_4.h
#ifndef AO_CAN_FILTER_IDE_4_31

#define AO_CAN_FILTER_IDE_4_31          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_4_31

#define AO_CAN_FILTER_MASK_4_31         (0)

#endif

#ifndef AO_CAN_FILTER_SID_4_31

#define AO_CAN_FILTER_SID_4_31          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_4_0

#define AO_CAN_FILTER_MASK_EID_4_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_4_0

#define AO_CAN_FILTER_MASK_IDE_4_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_4_0

#define AO_CAN_FILTER_MASK_SID_4_0      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_4_1

#define AO_CAN_FILTER_MASK_EID_4_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_4_1

#define AO_CAN_FILTER_MASK_IDE_4_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_4_1

#define AO_CAN_FILTER_MASK_SID_4_1      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_4_2

#define AO_CAN_FILTER_MASK_EID_4_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_4_2

#define AO_CAN_FILTER_MASK_IDE_4_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_4_2

#define AO_CAN_FILTER_MASK_SID_4_2      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_4_3

#define AO_CAN_FILTER_MASK_EID_4_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_4_3

#define AO_CAN_FILTER_MASK_IDE_4_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_4_3

#define AO_CAN_FILTER_MASK_SID_4_3      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_INVALID_4

#define AO_CAN_INVALID_4                (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_MODE_4

#define AO_CAN_MODE_4                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_OVERFLOW_4

#define AO_CAN_OVERFLOW_4               (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SENT_4

#define AO_CAN_SENT_4                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SYSTEM_4

#define AO_CAN_SYSTEM_4                 (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TIMER_4

#define AO_CAN_TIMER_4                  (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_UNDERFLOW_4

#define AO_CAN_UNDERFLOW_4              (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_WAKE_UP_4

#define AO_CAN_WAKE_UP_4                (false)

#endif

// ----------------------------------------------------------------------------

// Constants.

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_MAX_4

#define AO_CAN_BAUD_MAX_4               AO_CAN_BAUD_MAX(AO_SYS_CLOCK_CAN4)

#endif

#ifndef AO_CAN_BAUD_MIN_4

#define AO_CAN_BAUD_MIN_4               AO_CAN_BAUD_MIN(AO_SYS_CLOCK_CAN4)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUFFERS_4

#define AO_CAN_BUFFERS_4                                                    \
(                                                                           \
        (AO_CAN_BUFFERS_4_0)  +                                             \
        (AO_CAN_BUFFERS_4_1)  +                                             \
        (AO_CAN_BUFFERS_4_2)  +                                             \
        (AO_CAN_BUFFERS_4_3)  +                                             \
        (AO_CAN_BUFFERS_4_4)  +                                             \
        (AO_CAN_BUFFERS_4_5)  +                                             \
        (AO_CAN_BUFFERS_4_6)  +                                             \
        (AO_CAN_BUFFERS_4_7)  +                                             \
        (AO_CAN_BUFFERS_4_8)  +                                             \
        (AO_CAN_BUFFERS_4_9)  +                                             \
        (AO_CAN_BUFFERS_4_10) +                                             \
        (AO_CAN_BUFFERS_4_11) +                                             \
        (AO_CAN_BUFFERS_4_12) +                                             \
        (AO_CAN_BUFFERS_4_13) +                                             \
        (AO_CAN_BUFFERS_4_14) +                                             \
        (AO_CAN_BUFFERS_4_15) +                                             \
        (AO_CAN_BUFFERS_4_16) +                                             \
        (AO_CAN_BUFFERS_4_17) +                                             \
        (AO_CAN_BUFFERS_4_18) +                                             \
        (AO_CAN_BUFFERS_4_19) +                                             \
        (AO_CAN_BUFFERS_4_20) +                                             \
        (AO_CAN_BUFFERS_4_21) +                                             \
        (AO_CAN_BUFFERS_4_22) +                                             \
        (AO_CAN_BUFFERS_4_23) +                                             \
        (AO_CAN_BUFFERS_4_24) +                                             \
        (AO_CAN_BUFFERS_4_25) +                                             \
        (AO_CAN_BUFFERS_4_26) +                                             \
        (AO_CAN_BUFFERS_4_27) +                                             \
        (AO_CAN_BUFFERS_4_28) +                                             \
        (AO_CAN_BUFFERS_4_29) +                                             \
        (AO_CAN_BUFFERS_4_30) +                                             \
        (AO_CAN_BUFFERS_4_31)                                               \
)

#endif

// ----------------------------------------------------------------------------

