tinko26/ao/src/ao_sys_xc32_pic32/ao_can_4.h
#ifndef AO_CAN_FIFOS_4

#define AO_CAN_FIFOS_4                                                      \
(                                                                           \
        (AO_CAN_FIFOS_RX_4) +                                               \
        (AO_CAN_FIFOS_TX_4)                                                 \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_RX_4

#define AO_CAN_RX_4                                                         \
(                                                                           \
        (AO_CAN_FIFOS_RX_4) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TX_4

#define AO_CAN_TX_4                                                         \
(                                                                           \
        (AO_CAN_FIFOS_TX_4) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_can_reg_4

#define ao_can_reg_4()                                                      \
(                                                                           \
        (ao_can_reg_t *)                                                    \
        (                                                                   \
            _CAN4_BASE_ADDRESS                                              \
        )                                                                   \
)

#endif

// ----------------------------------------------------------------------------

void    ao_can_listen_all_4();

void    ao_can_listen_only_4();

void    ao_can_loopback_4();

void    ao_can_normal_4();

// ----------------------------------------------------------------------------

void    ao_can_start_4();

void    ao_can_stop_4();

// ----------------------------------------------------------------------------

void    ao_can_bus_4(                   ao_can_bus_t const * x);

void    ao_can_invalid_4();

void    ao_can_mode_4();

void    ao_can_overflow_4(              uint32_t fifos);

void    ao_can_sent_4(                  uint32_t fifos);

void    ao_can_system_4(                ao_can_system_t x);

void    ao_can_timer_4();

void    ao_can_underflow_4(             uint32_t fifos);

void    ao_can_wake_up_4();

// ----------------------------------------------------------------------------

extern  ao_send_obj_t                   ao_can_in_4     [AO_CAN_FIFOS_RX_4];

extern  ao_recv_obj_t                   ao_can_out_4    [AO_CAN_FIFOS_TX_4];

// ----------------------------------------------------------------------------

extern  ao_task_t                       ao_can_task_4;

// ----------------------------------------------------------------------------
